# Что такое инженерия и процесс разработки в целом?

"""
  Программная инженерия — это область компьютерной науки и технологии,
которая занимается построением программных систем. Суть методологии
программной инженерии состоит в применении систематизированного,
научного и предсказуемого процесса проектирования, разработки и
сопровождения программных средств.

  Процесс разработки программного обеспечения — структура,
согласно которой построена разработка.

  Шаги процесса:
    .1 Анализ требований и спецификация программного обеспечения.
    .2 Проектирование программного обеспечения.
    .3 Программирование.
    .4 Тестирование программного обеспечения.
    .5 Системная интеграция.
    .6 Установка программного обеспечения.
    .7 Сопровождение программного обеспечения.

  Модели процесса:
    .1 Каскадная модель.
      Переход на следующий этап означает полное
      завершение работ на предыдущем этапе.
    .2 Итерационная модель.
      Разбиение жизненного цикла проекта на
      последовательность итераций, каждая
      из которых напоминает «мини-проект»
    .3 Спиральная модель.
      Каждая итерация соответствует созданию
      фрагмента или версии ПО, на ней уточняются
      цели и характеристики проекта, оценивается
      качество полученных результатов и
      планируются работы следующей итерации.
"""
