# Какие принципы программирования существуют?

"""
1. Абстракция.
  В ООП это придание объекту характеристик, которые отличают
  его от всех объектов, четко определяя его концептуальные границы.
  Основная идея состоит в том, чтобы отделить способ использования
  составных объектов данных от деталей их реализации в виде более
  простых объектов.

2. Инкапсуляция.
  Инкапсуляция позволяет ограничить доступ к какой-либо функции в классе.
  Благодаря такому подходу злоумышленники или же мы сами не сможем
  случайно или намерено вызвать или изменить метод.

3. Наследование.
  Подразумевает то, что дочерний класс содержит все атрибуты
  родительского класса, при этом некоторые из них могут быть
  переопределены или добавлены в дочернем.

4. Полиморфизм.
  Разное поведение одного и того же метода в разных классах.
"""
