# Какие основные принципы ООП
# (наследование, инкапсуляция, полиморфизм)?

"""
1. Наследование.
  Подразумевает то, что дочерний класс содержит все атрибуты
  родительского класса, при этом некоторые из них могут быть
  переопределены или добавлены в дочернем.

2. Инкапсуляция.
  Инкапсуляция позволяет ограничить доступ к какой-либо функции в классе.
  Благодаря такому подходу злоумышленники или же мы сами не сможем
  случайно или намерено вызвать или изменить метод.

3. Полиморфизм.
  Разное поведение одного и того же метода в разных классах.
"""
