# Какие есть шесть этапов разработки продукта
# в Software Development lifecycle (SDLC)?

"""
Этап 1: Планирование и анализ потребностей.

 Выполняется старшими членами команды при участии клиентов,
отдела продаж, исследований рынка и экспертов в данной области.
На основании бизнес-логики проекта разрабатывается:
 - технико-экономическе обоснование
 - определение технических подходов
 - оценка рисков


Этап 2: Определение спецификации требований с SRS.

Осуществляется с помощью Software Requirements Specification.
SRS содержит все требования к продукту, которые должны быть
спроектированы и разработаны в течение жизненного цикла проекта.


Этап 3: Проектирование архитектуры продукта с DDS.

Осуществляется с помощью Design Support System — это
документ проектирования.
DDS четко определяет:
 - все архитектурные модули продукта
 - связь и представление потока данных
   с внешними и сторонними модулями
 - внутренний дизайн всех модулей
 - надежность продукта
 - временные ограничения
 - бюджетные ограничения


Этап 4: Создание или разработка продукта.

Начинается фактическая разработка и сборка продукта.
Программный код генерируется в соответствии с DDS на..
Разработчики должны следовать определенным их организацией
принципам кодированиядля.


Этап 5: Тестирование продукта.

Дефекты продукта регистрируются, отслеживаются, исправляются
и повторно тестируются до тех пор, пока продукт не достигнет стандартов
качества, определенных в SRS.


Этап 6: Развертывание на рынке и сопровождение.

Развертывание продукта происходит поэтапно в соответствии с
бизнес-стратегией организации. После того, как продукт выпущен на рынок,
его обслуживание выполняется для существующей клиентской базы.

"""

# Какая разница между Agile и Kanban?

"""
  Agile:
Семейство «гибких» подходов к разработке программного обеспечения.
Смысл сформулирован в Agile-манифесте разработки ПО:
 - Люди и взаимодействие важнее процессов и инструментов.
 - Работающий продукт важнее исчерпывающей документации.
 - Сотрудничество с заказчиком важнее согласования условий контракта.
 - Готовность к изменениям важнее следования первоначальному плану.

  Kanban:
Главный показатель эффективности в kanban – это среднее время
прохождения задачи по доске. Задача прошла быстро – команда
работала продуктивно и слаженно. Задача затянулась – надо думать,
на каком этапе и почему возникли задержки и чью работу надо
оптимизировать. Бизнес-процесс делится не на универсальные спринты,
а на стадии выполнения конкретных задач:
 - Планируется
 - Разрабатывается
 - Тестируется
 - Завершено

"""
